01  WS-AREA-1 PIC X(10). 
01  WS-AREA-2 PIC 9(5) VALUE 0. 
01  WS-AREA-3 PIC X(10). 

PROCEDURE DIVISION.
    MOVE "HELLO" TO WS-AREA-1
    MOVE WS-AREA-1 TO WS-AREA-3
    ADD 1 TO WS-AREA-2
    DISPLAY WS-AREA-1, WS-AREA-2, WS-AREA-3
    STOP RUN.